; domain
(define (domain zeno-travel)
(:requirements :typing :fluents)
(:types aircraft person city - object)
(:predicates (at ?x - (either person aircraft) ?c - city)
             (in ?p - person ?a - aircraft))
(:functions (fuel ?a - aircraft)
            (distance ?c1 - city ?c2 - city)
            (slow-burn ?a - aircraft)
            (fast-burn ?a - aircraft)
            (capacity ?a - aircraft)
            (total-fuel-used)
	    (onboard ?a - aircraft)
            (zoom-limit ?a - aircraft)
            )


(:action board
 :parameters (?p - person ?a - aircraft ?c - city)
 :precondition (and (at ?p ?c)
                 (at ?a ?c))
 :effect (and (not (at ?p ?c))
              (in ?p ?a)
		(increase (onboard ?a) 1)))


(:action debark
 :parameters (?p - person ?a - aircraft ?c - city)
 :precondition (and (in ?p ?a)
                 (at ?a ?c))
 :effect (and (not (in ?p ?a))
              (at ?p ?c)
		(decrease (onboard ?a) 1)))

(:action fly 
 :parameters (?a - aircraft ?c1 ?c2 - city)
 :precondition (and (at ?a ?c1)
                 (>= (fuel ?a) 
                         (* (distance ?c1 ?c2) (slow-burn ?a))))
 :effect (and (not (at ?a ?c1))
              (at ?a ?c2)
              (increase (total-fuel-used)
                         (* (distance ?c1 ?c2) (slow-burn ?a)))
              (decrease (fuel ?a) 
                         (* (distance ?c1 ?c2) (slow-burn ?a)))))
                                  
(:action zoom
 :parameters (?a - aircraft ?c1 ?c2 - city)
 :precondition (and (at ?a ?c1)
                 (>= (fuel ?a) 
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
                 (<= (onboard ?a) (zoom-limit ?a)))
 :effect (and (not (at ?a ?c1))
              (at ?a ?c2)
              (increase (total-fuel-used)
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
              (decrease (fuel ?a) 
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
	)
) 

(:action refuel	
 :parameters (?a - aircraft ?c - city)
 :precondition (and (> (capacity ?a) (fuel ?a))
               (at ?a ?c)
		)
 :effect (and (assign (fuel ?a) (capacity ?a)))
)


)

; problem
(define (problem ZTRAVEL-3-10)
(:domain zeno-travel)
(:objects
	plane1 - aircraft
	plane2 - aircraft
	plane3 - aircraft
	person1 - person
	person2 - person
	person3 - person
	person4 - person
	person5 - person
	person6 - person
	person7 - person
	person8 - person
	person9 - person
	person10 - person
	city0 - city
	city1 - city
	city2 - city
	city3 - city
	city4 - city
	city5 - city
	city6 - city
	)
(:init
	(at plane1 city3)
	(= (capacity plane1) 6130)
	(= (fuel plane1) 1643)
	(= (slow-burn plane1) 2)
	(= (fast-burn plane1) 5)
	(= (onboard plane1) 0)
	(= (zoom-limit plane1) 5)
	(at plane2 city0)
	(= (capacity plane2) 8435)
	(= (fuel plane2) 2199)
	(= (slow-burn plane2) 4)
	(= (fast-burn plane2) 8)
	(= (onboard plane2) 0)
	(= (zoom-limit plane2) 7)
	(at plane3 city6)
	(= (capacity plane3) 8444)
	(= (fuel plane3) 850)
	(= (slow-burn plane3) 4)
	(= (fast-burn plane3) 11)
	(= (onboard plane3) 0)
	(= (zoom-limit plane3) 1)
	(at person1 city4)
	(at person2 city3)
	(at person3 city3)
	(at person4 city3)
	(at person5 city4)
	(at person6 city2)
	(at person7 city6)
	(at person8 city5)
	(at person9 city0)
	(at person10 city3)
	(= (distance city0 city0) 0)
	(= (distance city0 city1) 637)
	(= (distance city0 city2) 523)
	(= (distance city0 city3) 996)
	(= (distance city0 city4) 540)
	(= (distance city0 city5) 573)
	(= (distance city0 city6) 539)
	(= (distance city1 city0) 637)
	(= (distance city1 city1) 0)
	(= (distance city1 city2) 640)
	(= (distance city1 city3) 724)
	(= (distance city1 city4) 749)
	(= (distance city1 city5) 947)
	(= (distance city1 city6) 507)
	(= (distance city2 city0) 523)
	(= (distance city2 city1) 640)
	(= (distance city2 city2) 0)
	(= (distance city2 city3) 637)
	(= (distance city2 city4) 985)
	(= (distance city2 city5) 610)
	(= (distance city2 city6) 708)
	(= (distance city3 city0) 996)
	(= (distance city3 city1) 724)
	(= (distance city3 city2) 637)
	(= (distance city3 city3) 0)
	(= (distance city3 city4) 628)
	(= (distance city3 city5) 681)
	(= (distance city3 city6) 635)
	(= (distance city4 city0) 540)
	(= (distance city4 city1) 749)
	(= (distance city4 city2) 985)
	(= (distance city4 city3) 628)
	(= (distance city4 city4) 0)
	(= (distance city4 city5) 707)
	(= (distance city4 city6) 628)
	(= (distance city5 city0) 573)
	(= (distance city5 city1) 947)
	(= (distance city5 city2) 610)
	(= (distance city5 city3) 681)
	(= (distance city5 city4) 707)
	(= (distance city5 city5) 0)
	(= (distance city5 city6) 651)
	(= (distance city6 city0) 539)
	(= (distance city6 city1) 507)
	(= (distance city6 city2) 708)
	(= (distance city6 city3) 635)
	(= (distance city6 city4) 628)
	(= (distance city6 city5) 651)
	(= (distance city6 city6) 0)
	(= (total-fuel-used) 0)
)
(:goal (and
	(at plane3 city5)
	(at person1 city0)
	(at person2 city3)
	(at person3 city6)
	(at person4 city2)
	(at person5 city6)
	(at person6 city0)
	(at person7 city2)
	(at person8 city0)
	(at person9 city0)
	(at person10 city2)
	))

(:metric minimize (+ (* 1 (total-time))  (* 3 (total-fuel-used))))
)

; plan
1. (fly plane2 city0 city4)
   deleted: (at plane2 city0)
   added: (at plane2 city4)
   changed: (total-fuel-used) from 0 to 2160, (fuel plane2) from 2199 to 39
   goals met: 2 of 11
2. (board person3 plane1 city3)
   deleted: (at person3 city3)
   added: (in person3 plane1)
   changed: (onboard plane1) from 0 to 1
   goals met: 2 of 11
3. (board person10 plane1 city3)
   deleted: (at person10 city3)
   added: (in person10 plane1)
   changed: (onboard plane1) from 1 to 2
   goals met: 2 of 11
4. (refuel plane3 city6)
   changed: (fuel plane3) from 850 to 8444
   goals met: 2 of 11
5. (fly plane3 city6 city5)
   deleted: (at plane3 city6)
   added: (at plane3 city5)
   changed: (total-fuel-used) from 2160 to 4764, (fuel plane3) from 8444 to 5840
   goals met: 3 of 11
6. (board person4 plane1 city3)
   deleted: (at person4 city3)
   added: (in person4 plane1)
   changed: (onboard plane1) from 2 to 3
   goals met: 3 of 11
7. (refuel plane1 city3)
   changed: (fuel plane1) from 1643 to 6130
   goals met: 3 of 11
8. (zoom plane1 city3 city4)
   deleted: (at plane1 city3)
   added: (at plane1 city4)
   changed: (total-fuel-used) from 4764 to 7904, (fuel plane1) from 6130 to 2990
   goals met: 3 of 11
9. (board person8 plane3 city5)
   deleted: (at person8 city5)
   added: (in person8 plane3)
   changed: (onboard plane3) from 0 to 1
   goals met: 3 of 11
10. (fly plane3 city5 city0)
   deleted: (at plane3 city5)
   added: (at plane3 city0)
   changed: (total-fuel-used) from 7904 to 10196, (fuel plane3) from 5840 to 3548
   goals met: 2 of 11
11. (debark person8 plane3 city0)
   deleted: (in person8 plane3)
   added: (at person8 city0)
   changed: (onboard plane3) from 1 to 0
   goals met: 3 of 11
12. (fly plane3 city0 city5)
   deleted: (at plane3 city0)
   added: (at plane3 city5)
   changed: (total-fuel-used) from 10196 to 12488, (fuel plane3) from 3548 to 1256
   goals met: 4 of 11
13. (board person1 plane1 city4)
   deleted: (at person1 city4)
   added: (in person1 plane1)
   changed: (onboard plane1) from 3 to 4
   goals met: 4 of 11
14. (board person5 plane1 city4)
   deleted: (at person5 city4)
   added: (in person5 plane1)
   changed: (onboard plane1) from 4 to 5
   goals met: 4 of 11
15. (fly plane1 city4 city6)
   deleted: (at plane1 city4)
   added: (at plane1 city6)
   changed: (total-fuel-used) from 12488 to 13744, (fuel plane1) from 2990 to 1734
   goals met: 4 of 11
16. (debark person3 plane1 city6)
   deleted: (in person3 plane1)
   added: (at person3 city6)
   changed: (onboard plane1) from 5 to 4
   goals met: 5 of 11
17. (debark person5 plane1 city6)
   deleted: (in person5 plane1)
   added: (at person5 city6)
   changed: (onboard plane1) from 4 to 3
   goals met: 6 of 11
18. (board person7 plane1 city6)
   deleted: (at person7 city6)
   added: (in person7 plane1)
   changed: (onboard plane1) from 3 to 4
   goals met: 6 of 11
19. (fly plane1 city6 city2)
   deleted: (at plane1 city6)
   added: (at plane1 city2)
   changed: (total-fuel-used) from 13744 to 15160, (fuel plane1) from 1734 to 318
   goals met: 6 of 11
20. (debark person4 plane1 city2)
   deleted: (in person4 plane1)
   added: (at person4 city2)
   changed: (onboard plane1) from 4 to 3
   goals met: 7 of 11
21. (debark person7 plane1 city2)
   deleted: (in person7 plane1)
   added: (at person7 city2)
   changed: (onboard plane1) from 3 to 2
   goals met: 8 of 11
22. (debark person10 plane1 city2)
   deleted: (in person10 plane1)
   added: (at person10 city2)
   changed: (onboard plane1) from 2 to 1
   goals met: 9 of 11
23. (board person6 plane1 city2)
   deleted: (at person6 city2)
   added: (in person6 plane1)
   changed: (onboard plane1) from 1 to 2
   goals met: 9 of 11
24. (refuel plane1 city2)
   changed: (fuel plane1) from 318 to 6130
   goals met: 9 of 11
25. (zoom plane1 city2 city0)
   deleted: (at plane1 city2)
   added: (at plane1 city0)
   changed: (total-fuel-used) from 15160 to 17775, (fuel plane1) from 6130 to 3515
   goals met: 9 of 11
26. (debark person1 plane1 city0)
   deleted: (in person1 plane1)
   added: (at person1 city0)
   changed: (onboard plane1) from 2 to 1
   goals met: 10 of 11
27. (debark person6 plane1 city0)
   deleted: (in person6 plane1)
   added: (at person6 city0)
   changed: (onboard plane1) from 1 to 0
   goals met: 11 of 11
